# Lab 3: Laboratory Notes - Week 3: Exploratory analysis

From last week, you were to explore Open Data that's related to your campus location as well as the <span style="color:red">northwind.db</span>.  We do note that you may not have done enough SQL if you have not taken F28DM (and some of you will NOT be taking that course).  However, do keep the database and you can use it as a supplementary material to learn SQL with.  This week's laboratory work seems shorter but it is meant for you to explore while you go through it.  You will encounter errors and also experience various ways of handling the <span style="color:red">pandas</span> DataFrames.  For this week, we will start with exploring a data set.

## Initial Data Auditing

We'll now check various characteristics of the data. First let's have a look at the dimensions of the table:

<span style="color:red">import pandas as pd</span>  
<span style="color:red">url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"</span>  
<span style="color:red">titanic = pd.read_csv(url)</span>  
<span style="color:red">print(titanic.shape)</span>  

How many rows and columns are there?

We can investigate the data types of each column, by calling " <span style="color:red">dtypes</span>" on the entire DataFrame:

<span style="color:red">titanic.dtypes</span>

Once we have some idea, an important numeric audit is the 5 number summary.

## 5 Number Summary

A "5 number summary" is used for descriptive analyses of large data sets, or as a preliminary investigation.  This is typically the step after ensuring that you have read the data correctly (using <span style="color:red">head()</span> or <span style="color:red">tail()</span>).  The 5 values consist of:

maximum
minimum
median
lower (or first) quartile (25%)
upper (or third) quartile (75%)
For those who are well versed with boxplots, they are similar.  In addition to these 5 number summaries, many descriptive analyses will also provide the mean number.  Do note that this is only for numeric data, while categorical data have a different descriptive analysis. We use the variable name df here as a general reference to a DataFrame type. Substitute it appropriately with your DataFrame.

df.describe()

For categorical data, this 5 numbers summary (including mean) may not mean much.  For categorical data, you may want to look at the count of the occurrence, the frequency, the top (number of frequency), and for any unique values.  For this, you inform the describe() function that you want to include the objects.   

df.describe(include='object')

With the head(), tail() and describe(), you would have the basics to get a feel of the data.  (You should be asking why .shape and .dtypes do not have parentheses.  Why?).

We will repeat this again next week.

## My code part

In [1]:
import pandas as pd
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
titanic = pd.read_csv(url)
print(titanic.shape)

(891, 12)

In [2]:
print(titanic.select_dtypes)

<bound method DataFrame.select_dtypes of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [3]:
print(titanic.head())
print(titanic.tail())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

In [4]:
df=titanic.dropna()
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000
mean,455.366120,0.672131,1.191257,35.674426,0.464481,0.475410,78.682469
std,247.052476,0.470725,0.515187,15.643866,0.644159,0.754617,76.347843
min,2.000000,0.000000,1.000000,0.920000,0.000000,0.000000,0.000000
25%,263.500000,0.000000,1.000000,24.000000,0.000000,0.000000,29.700000
50%,457.000000,1.000000,1.000000,36.000000,0.000000,0.000000,57.000000
75%,676.000000,1.000000,1.000000,47.500000,1.000000,1.000000,90.000000
max,890.000000,1.000000,3.000000,80.000000,3.000000,4.000000,512.329200

In [5]:
df.describe(include='object')

,Name,Sex,Ticket,Cabin,Embarked
count,183,183,183,183,183
unique,183,2,127,133,3
top,"Cumings, Mrs. John Bradley (Florence Briggs Th...",male,19950,G6,S
freq,1,95,4,4,116

In [6]:
data=pd.read_csv("filename.csv")
data.columns

Index(['Unnamed: 0', 'names', 'ages', 'heights'], dtype='object')

In [7]:
list(data.columns)

['Unnamed: 0', 'names', 'ages', 'heights']

In [8]:
data.loc

In [9]:
data.iloc()

In [10]:
data.loc[:,"ages"]

0     76
1     82
2    104
3     78
4     23
5     53
6     47
7     88
8     37
Name: ages, dtype: int64

In [11]:
data.iloc[:3,2]

0     76
1     82
2    104
Name: ages, dtype: int64

In [12]:
data.loc[1]

Unnamed: 0       2
names          Ted
ages            82
heights       1.69
Name: 1, dtype: object

In [13]:
x = data["ages"]
print(x)

0     76
1     82
2    104
3     78
4     23
5     53
6     47
7     88
8     37
Name: ages, dtype: int64

In [14]:
y = data[["ages"]]
print(y)

   ages
0    76
1    82
2   104
3    78
4    23
5    53
6    47
7    88
8    37

In [15]:
print(type(x))
print(type(y))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [16]:
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)

In [17]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [18]:
df[['Name', 'Survived']]

                                                  Name  Survived
0                              Braund, Mr. Owen Harris         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                               Heikkinen, Miss. Laina         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)         1
4                             Allen, Mr. William Henry         0
..                                                 ...       ...
886                              Montvila, Rev. Juozas         0
887                       Graham, Miss. Margaret Edith         1
888           Johnston, Miss. Catherine Helen "Carrie"         0
889                              Behr, Mr. Karl Howell         1
890                                Dooley, Mr. Patrick         0

[891 rows x 2 columns]

In [19]:
df['Name'][884]

'Sutehall, Mr. Henry Jr'

In [20]:
df['Name'][880:884]

880    Shelley, Mrs. William (Imanita Parrish Hall)
881                              Markun, Mr. Johann
882                    Dahlberg, Miss. Gerda Ulrika
883                   Banfield, Mr. Frederick James
Name: Name, dtype: object

In [21]:
df[['Name','Survived']][880:884]

                                             Name  Survived
880  Shelley, Mrs. William (Imanita Parrish Hall)         1
881                            Markun, Mr. Johann         0
882                  Dahlberg, Miss. Gerda Ulrika         0
883                 Banfield, Mr. Frederick James         0

In [22]:
df.loc[880:884,['Name','Survived']]

                                             Name  Survived
880  Shelley, Mrs. William (Imanita Parrish Hall)         1
881                            Markun, Mr. Johann         0
882                  Dahlberg, Miss. Gerda Ulrika         0
883                 Banfield, Mr. Frederick James         0
884                        Sutehall, Mr. Henry Jr         0

In [23]:
df.loc[2]

PassengerId                         3
Survived                            1
Pclass                              3
Name           Heikkinen, Miss. Laina
Sex                            female
Age                              26.0
SibSp                               0
Parch                               0
Ticket               STON/O2. 3101282
Fare                            7.925
Cabin                             NaN
Embarked                            S
Name: 2, dtype: object

In [24]:
df.loc[df['Age'] <= 6]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S
16,17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,NaN,Q
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
58,59,1,2,"West, Miss. Constance Mirium",female,5.00,1,2,C.A. 34651,27.7500,NaN,S
63,64,0,3,"Skoog, Master. Harald",male,4.00,3,2,347088,27.9000,NaN,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.00,4,2,347082,31.2750,NaN,S
164,165,0,3,"Panula, Master. Eino Viljami",male,1.00,4,1,3101295,39.6875,NaN,S
171,172,0,3,"Rice, Master. Arthur",male,4.00,4,1,382652,29.1250,NaN,Q
172,173,1,3,"Johnson, Miss. Eleanor Ileen",female,1.00,1,1,347742,11.1333,NaN,S
183,184,1,2,"Becker, Master. Richard F",male,1.00,2,1,230136,39.0000,F4,S
184,185,1,3,"Kink-Heilmann, Miss. Luise Gretchen",female,4.00,0,2,315153,22.0250,NaN,S
193,194,1,2,"Navratil, Master. Michel M",male,3.00,1,1,230080,26.0000,F2,S
205,206,0,3,"Strom, Miss. Telma Matilda",female,2.00,0,1,347054,10.4625,G6,S
233,234,1,3,"Asplund, Miss. Lillian Gertrud",female,5.00,4,2,347077,31.3875,NaN,S
261,262,1,3,"Asplund, Master. Edvin Rojj Felix",male,3.00,4,2,347077,31.3875,NaN,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
340,341,1,2,"Navratil, Master. Edmond Roger",male,2.00,1,1,230080,26.0000,F2,S
348,349,1,3,"Coutts, Master. William Loch ""William""",male,3.00,1,1,C.A. 37671,15.9000,NaN,S
374,375,0,3,"Palsson, Miss. Stina Viola",female,3.00,3,1,349909,21.0750,NaN,S
381,382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.00,0,2,2653,15.7417,NaN,C
386,387,0,3,"Goodwin, Master. Sidney Leonard",male,1.00,5,2,CA 2144,46.9000,NaN,S
407,408,1,2,"Richards, Master. William Rowe",male,3.00,1,1,29106,18.7500,NaN,S
445,446,1,1,"Dodge, Master. Washington",male,4.00,0,2,33638,81.8583,A34,S
448,449,1,3,"Baclini, Miss. Marie Catherine",female,5.00,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
479,480,1,3,"Hirvonen, Miss. Hildur E",female,2.00,0,1,3101298,12.2875,NaN,S
530,531,1,2,"Quick, Miss. Phyllis May",female,2.00,1,1,26360,26.0000,NaN,S
618,619,1,2,"Becker, Miss. Marion Louise",female,4.00,2,1,230136,39.0000,F4,S
642,643,0,3,"Skoog, Miss. Margit Elizabeth",female,2.00,3,2,347088,27.9000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
691,692,1,3,"Karun, Miss. Manca",female,4.00,0,1,349256,13.4167,NaN,C
720,721,1,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.00,0,1,248727,33.0000,NaN,S
750,751,1,2,"Wells, Miss. Joan",female,4.00,1,1,29103,23.0000,NaN,S
751,752,1,3,"Moor, Master. Meier",male,6.00,0,1,392096,12.4750,E121,S
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
777,778,1,3,"Emanuel, Miss. Virginia Ethel",female,5.00,0,0,364516,12.4750,NaN,S
788,789,1,3,"Dean, Master. Bertram Vere",male,1.00,1,2,C.A. 2315,20.5750,NaN,S
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
813,814,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.00,4,2,347082,31.2750,NaN,S
824,825,0,3,"Panula, Master. Urho Abraham",male,2.00,4,1,3101295,39.6875,NaN,S
827,828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,347082,31.2750,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S

In [25]:
df2 = df.loc[df['Age'] >= 12]

In [26]:
df2.to_csv('new_titanic.csv')

In [27]:
df2.to_csv('new_titanic.csv', index=None, header=True)

In [28]:
df['Age'].mean()

np.float64(29.69911764705882)

In [29]:
df['Age'].max() # oldest
df['Age'].min() # youngest
df['Age'].sum() # total years
df['Age'].std() # standard deviation
df['Age'].median() # half of the people were older (/younger)
df['Age'].mode() # most common age

0    24.0
Name: Age, dtype: float64

In [30]:
sex_class = df.groupby(['Sex','Pclass'])['Age']
sex_class.mean()

Sex     Pclass
female  1         34.611765
        2         28.722973
        3         21.750000
male    1         41.281386
        2         30.740707
        3         26.507589
Name: Age, dtype: float64

In [31]:
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
titanic = pd.read_csv(url)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
fun = {'PassengerId':'count','Age':'mean'}

In [33]:
groupbyClass = titanic.groupby('Pclass').agg(fun)
groupbyClass

        PassengerId        Age
Pclass
1               216  38.233441
2               184  29.877630
3               491  25.140620

In [34]:
fun2 = {'PassengerId':'count','Age':{'mean', 'max', 'min'}}
groupbyClass2 = titanic.groupby('Pclass').agg(fun2)
groupbyClass2

       PassengerId        Age
             count       mean   min   max
Pclass
1              216  38.233441  0.92  80.0
2              184  29.877630  0.67  70.0
3              491  25.140620  0.42  74.0

In [35]:
groupbyClass2 = groupbyClass2.reset_index()
# turn 'class' groups into column values
groupbyClass2.columns = groupbyClass2.columns.droplevel(0)
# drop the top level in the column hierarchy
groupbyClass2

      count       mean   min   max
0  1    216  38.233441  0.92  80.0
1  2    184  29.877630  0.67  70.0
2  3    491  25.140620  0.42  74.0

In [36]:
groupbyClass2.rename(columns = {'':'class'},inplace = True)
# rename the first column to be 'class'
groupbyClass2

   class  count       mean   min   max
0      1    216  38.233441  0.92  80.0
1      2    184  29.877630  0.67  70.0
2      3    491  25.140620  0.42  74.0

In [38]:
my_list = (80,20,64,19,56,12,88)
sum(e>50 for e in my_list)

4

In [39]:
fun3 = {'Age':{'nunique', lambda x: sum(e>50 for e in x)}}

In [ ]:
groupbyClass3 = titanic.groupby('Pclass').agg(fun3).reset_index()
groupbyClass3

  Pclass        Age
         <lambda_0> nunique
0      1         39      57
1      2         15      57
2      3         10      68

In [40]:
groupbyClass3.columns = groupbyClass3.columns.droplevel(0)
groupbyClass3.rename(columns = {'':'class'},inplace = True)
groupbyClass3

   class  <lambda_0>  nunique
0      1          39       57
1      2          15       57
2      3          10       68

In [41]:
groupbyClass3.rename(columns = {'nunique':'unique age count','<lambda_0>':'over 50s count'}, inplace = True)
groupbyClass3

   class  over 50s count  unique age count
0      1              39                57
1      2              15                57
2      3              10                68